docs/hp42s-meta.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 12:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>free42/hp42s/DM42 Programming Tools</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Random stuff to assist with free42/hp-42s/DM42 programing"
 />











</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://richmit.github.io/hp42/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content">
<h1 class="title">free42/hp42s/DM42 Programming Tools</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2021-03-28 12:22:35</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright 2021 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8778227">1. Metadata</a></li>
<li><a href="#org0b5828c">2. Introduction</a></li>
<li><a href="#org20150bb">3. Generateing 42s code</a>
<ul>
<li><a href="#orgadb6630">3.1. Menus</a>
<ul>
<li><a href="#orgbcf6999">3.1.1. Generic menu generator</a></li>
<li><a href="#org09351fd">3.1.2. For CUSTOM-type Menus</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8b58670">4. Emacs Helper Stuff</a>
<ul>
<li><a href="#org0ac5fbe">4.1. Emacs function to insert charcters given a list of character codes</a></li>
<li><a href="#orgf34f845">4.2. Emacs Mode for 42s Code</a></li>
<li><a href="#org7cce9a2">4.3. yas templates</a></li>
</ul>
</li>
<li><a href="#org6d58f1d">5. Prepare Code For Conversion</a>
<ul>
<li><a href="#org0df720b">5.1. DM42 DMCP-3.20 / DM42-3.17</a></li>
<li><a href="#orgc58fdf9">5.2. free42 3.0.1 or newer</a></li>
</ul>
</li>
<li><a href="#orga073782">6. 42s Notes</a>
<ul>
<li><a href="#org404fc59">6.1. Character Set</a></li>
<li><a href="#orgace88e4">6.2. Date format</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org8778227" class="outline-2">
<h2 id="org8778227"><span class="section-number-2">1</span> Metadata</h2>
<div class="outline-text-2" id="text-1">
<p>
This home for this HTML file is: <a href="https://richmit.github.io/hp42/hp42s-meta.html">https://richmit.github.io/hp42/hp42s-meta.html</a>
</p>

<p>
Files related to this document may be found on github: <a href="https://github.com/richmit/hp42">https://github.com/richmit/hp42</a>
</p>

<ul class="org-ul">
<li><code>src</code> directory: Contains the org-mode file that generated this HTML document</li>
<li><code>docs</code> directory: Contains this html document</li>
<li><code>bin</code> directory: Contains raw program files</li>
</ul>
</div>
</div>


<div id="outline-container-org0b5828c" class="outline-2">
<h2 id="org0b5828c"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
This org-mode document contains various tools (mostly for Emacs) that help me write programs for the 42s:
</p>

<ul class="org-ul">
<li>Elisp function to generate 42s menu programs</li>
<li>A tool to insert free42 utf-8 characters given a list of character numbers</li>
<li>Elisp function to generate custom menus (menus of built-in functions and global labels)</li>
<li>yasnippet templates to help type code</li>
<li>ElISP Code to translate my code listings into code for free42 &amp; MD42</li>
<li>42s notes
<ul class="org-ul">
<li>free42 utf-8 characters with character numbers</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org20150bb" class="outline-2">
<h2 id="org20150bb"><span class="section-number-2">3</span> Generateing 42s code</h2>
<div class="outline-text-2" id="text-3">
</div>
