src/hp42s-meta.org
*** Generic menu generator

This code will read an org-mode table describing a menu, and generate 42s code to implement the menu.  The menus may be of arbitrary depth and size; however,
two digit local labels are used in the generated code which limits sizes.

=MJR-generate-42-menu-code= arguments:
  - =top-lab=  The global label to use for the generated program
  - =tbl= The org-mode table with the menu description
  - =leaf-function= What do do when a /action/ menu is used (a leaf node in the menu).
    - ="stay"= Keep the menu active.
    - ="exit"= Exit the menu.
  - =exit-function= What to do when =[EXIT]= is pressed.
    - ="exit"= Exit the application.
    - ="up"= Go up to parent, or exit if we are in the top menu.
  - =gen-code= A function that generates the code for the /action/.  It gets a list that contains the table row for the menu item.

The first column of the table defines the menu key labels.  =foo:bar:foobar= defines a top level button named =foo= that leads to a menu containing another
menu named =bar= which contains an /action/ named =foobar=.  The rest of the columns are used by the =gen-code= function to write the code for each item.  A
blank entry in the first column leaves a blank menu button.  A more complete example:

| Menu           |
|----------------|
| foo:bar:foobar |
| foo:bill       |
| foo:ted        |
| snoopy         |

The top level menu will have "=foo=" & "=snoopy=".  "=snoopy=" is an /action/ button while "=foo=" brings up a menu containing "=bar=", "=bill=", & "=ted=".
The last two are /actions/ while the first is yet another menu containing "=foobar=".

#+BEGIN_SRC elisp :results output verbatum
(defun MJR-generate-42-menu-code (top-lab tbl leaf-function exit-function gen-code) ;; leaf-function "stay" or "exit", exit-function "exit" or "up"
  (let* ((min-free-lab  2)
         (m-code "")
         (x-code ""))
    (cl-labels ((add-m-code (a) (setq m-code (concat m-code a "\n")))
                (add-x-code (a) (setq x-code (concat x-code a "\n")))
                (prc-mnu (menu) (if (or (not (listp menu))
                                        (null (cdr menu)))
                                    menu
                                    (mapcar #'prc-mnu
                                            (append (list (car menu))
                                                    (reverse (cl-reduce (lambda (result cur-elt)
                                                                          (let ((last-elt (cl-first result)))
                                                                            (if (and (listp last-elt)
                                                                                     (cdr last-elt)
                                                                                     (cdr cur-elt)
                                                                                     (string-equal (cl-first last-elt) (cl-first cur-elt)))
                                                                                (progn (nconc (cl-first result) (list (cdr cur-elt)))
                                                                                       result)
                                                                                (if (cdr cur-elt)
                                                                                    (append (list (list (cl-first cur-elt) (cdr cur-elt))) result)
                                                                                    (append (list (cl-first cur-elt))  result)))))
                                                                        (cdr menu)
                                                                        :initial-value ()))))))
                (gen-mnu (plbl lbl menu) (let* ((num-menu-keys (1- (length menu)))
                                                (num-menu-page (ceiling (/ num-menu-keys 6.0)))
                                                (page-labs     (cl-loop repeat num-menu-page
                                                                        for i = lbl then min-free-lab
                                                                        collect i
                                                                        when (not (= i lbl))
                                                                        do (cl-incf min-free-lab)))
                                                (rec-key-labs     nil)
                                                (rec-pag-labs     nil))
                                           (if (zerop plbl)
                                               (add-m-code (message "LBL \"%s\"" (cl-first menu))))
                                           (cl-loop for mkey-elt in (cdr menu)
                                                    for mkey-num from 0
                                                    for page-num = (truncate (/ mkey-num 6))
                                                    for page-key = (mod mkey-num 6)
                                                    for mkey-str = (if (vectorp mkey-elt) (aref mkey-elt 0) (cl-first mkey-elt))
                                                    when (= page-key 0)
                                                    do (progn (add-m-code (message "LBL %02d            @@@@ Page %d of menu %s" (nth page-num page-labs) (1+ page-num) (cl-first menu)))
                                                              (add-m-code "CLMENU"))
                                                    when (not (string-equal mkey-str ""))
                                                    do (progn (add-m-code (message "\"%s\"" mkey-str))
                                                              (add-m-code (message "KEY %d %s %02d" (1+ page-key) (if (vectorp mkey-elt) "XEQ" "GTO") min-free-lab))
                                                              (if (vectorp mkey-elt)
                                                                  (progn (add-x-code (message "LBL %02d               @@@@ Action for menu key %s" min-free-lab mkey-str))
                                                                         (add-x-code (funcall gen-code (aref mkey-elt 1)))
                                                                         (add-x-code "RTN")))
                                                              (push min-free-lab rec-key-labs)
                                                              (cl-incf min-free-lab)
                                                              (push (nth page-num page-labs) rec-pag-labs))
                                                    when (or (= page-key 5) (= mkey-num (1- num-menu-keys)))
                                                    do (progn (if (< 1 num-menu-page)
                                                                  (progn (add-m-code (message "KEY 7 GTO %02d" (nth (mod (1- page-num) num-menu-page) page-labs)))
                                                                         (add-m-code (message "KEY 8 GTO %02d" (nth (mod (1+ page-num) num-menu-page) page-labs)))))
                                                              (if (string-equal exit-function "up")
                                                                  (add-m-code (message "KEY 9 GTO %02d" plbl))
                                                                  (add-m-code (message "KEY 9 GTO %02d" 0)))
                                                              (add-m-code "MENU")
                                                              (add-m-code "STOP")
                                                              (if (string-equal leaf-function "stay")
                                                                  (add-m-code (message "GTO %02d" (nth page-num page-labs)))
                                                                  (add-m-code (message "GTO %02d" 0)))))
                                           (cl-loop for mkey-elt in (cdr menu)
                                                    for m-lab in (reverse rec-key-labs)
                                                    for p-lab in (reverse rec-pag-labs)
                                                    when (listp mkey-elt)
                                                    do (gen-mnu p-lab m-lab mkey-elt)))))
      (gen-mnu 0 1 (prc-mnu (append (list top-lab) (cl-loop for row in tbl
                                                            for n from 0
                                                            for tmp = (split-string (message "%s" (cl-first row)) ":")
                                                            do (setf (car (last tmp)) (vector (car (last tmp)) row))
                                                            collect tmp))))
      (add-m-code "LBL 00")
      (add-m-code "EXITALL")
      (add-m-code "RTN")
      (if (< 100 min-free-lab)
          (error "ERROR: Too many local labels: %d" min-free-lab)))
    (princ m-code)
    (princ x-code)
    (princ (message "@@@@ Free labels start at: %d\n" min-free-lab))
    (princ "END")))
#+END_SRC

#+RESULTS:

