docs/hp42s-meta.html
<div id="outline-container-orgadb6630" class="outline-3">
<h3 id="orgadb6630"><span class="section-number-3">3.1</span> Menus</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-orgbcf6999" class="outline-4">
<h4 id="orgbcf6999"><span class="section-number-4">3.1.1</span> Generic menu generator</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
This code will read an org-mode table describing a menu, and generate 42s code to implement the menu.  The menus may be of arbitrary depth and size; however,
two digit local labels are used in the generated code which limits sizes.
</p>

<p>
<code>MJR-generate-42-menu-code</code> arguments:
</p>
<ul class="org-ul">
<li><code>top-lab</code>  The global label to use for the generated program</li>
<li><code>tbl</code> The org-mode table with the menu description</li>
<li><code>leaf-function</code> What do do when a <i>action</i> menu is used (a leaf node in the menu).   
<ul class="org-ul">
<li><code>"stay"</code> Keep the menu active.</li>
<li><code>"exit"</code> Exit the menu.</li>
</ul></li>
<li><code>exit-function</code> What to do when <code>[EXIT]</code> is pressed.
<ul class="org-ul">
<li><code>"exit"</code> Exit the application.</li>
<li><code>"up"</code> Go up to parent, or exit if we are in the top menu.</li>
</ul></li>
<li><code>gen-code</code> A function that generates the code for the <i>action</i>.  It gets a list that contains the table row for the menu item.</li>
</ul>

<p>
The first column of the table defines the menu key labels.  <code>foo:bar:foobar</code> defines a top level button named <code>foo</code> that leads to a menu containing another
menu named <code>bar</code> which contains an <i>action</i> named <code>foobar</code>.  The rest of the columns are used by the <code>gen-code</code> function to write the code for each item.  A
blank entry in the first column leaves a blank menu button.  A more complete example:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">foo:bar:foobar</td>
</tr>

<tr>
<td class="org-left">foo:bill</td>
</tr>

<tr>
<td class="org-left">foo:ted</td>
</tr>

<tr>
<td class="org-left">snoopy</td>
</tr>
</tbody>
</table>

<p>
The top level menu will have "<code>foo</code>" &amp; "<code>snoopy</code>".  "<code>snoopy</code>" is an <i>action</i> button while "<code>foo</code>" brings up a menu containing "<code>bar</code>", "<code>bill</code>", &amp; "<code>ted</code>".
The last two are <i>actions</i> while the first is yet another menu containing "<code>foobar</code>".
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00ffff;">defun</span> <span style="color: #00fa9a; font-weight: bold;">MJR-generate-42-menu-code</span> (top-lab tbl leaf-function exit-function gen-code) <span style="color: #ffa500;">;; </span><span style="color: #ff7f24;">leaf-function "stay" or "exit", exit-function "exit" or "up"</span>
  (<span style="color: #00ffff;">let*</span> ((min-free-lab  2)
         (m-code <span style="color: #fa8072;">""</span>)
         (x-code <span style="color: #fa8072;">""</span>))
    (<span style="color: #00ffff;">cl-labels</span> ((add-m-code (a) (<span style="color: #00ffff;">setq</span> m-code (concat m-code a <span style="color: #fa8072;">"\n"</span>)))
                (add-x-code (a) (<span style="color: #00ffff;">setq</span> x-code (concat x-code a <span style="color: #fa8072;">"\n"</span>)))
                (prc-mnu (menu) (<span style="color: #00ffff;">if</span> (<span style="color: #00ffff;">or</span> (not (listp menu))
                                        (null (cdr menu)))
                                    menu
                                    (mapcar #'prc-mnu
                                            (append (list (car menu))
                                                    (reverse (cl-reduce (<span style="color: #00ffff;">lambda</span> (result cur-elt)
                                                                          (<span style="color: #00ffff;">let</span> ((last-elt (cl-first result)))
                                                                            (<span style="color: #00ffff;">if</span> (<span style="color: #00ffff;">and</span> (listp last-elt)
                                                                                     (cdr last-elt)
                                                                                     (cdr cur-elt)
                                                                                     (string-equal (cl-first last-elt) (cl-first cur-elt)))
                                                                                (<span style="color: #00ffff;">progn</span> (nconc (cl-first result) (list (cdr cur-elt)))
                                                                                       result)
                                                                                (<span style="color: #00ffff;">if</span> (cdr cur-elt)
                                                                                    (append (list (list (cl-first cur-elt) (cdr cur-elt))) result)
                                                                                    (append (list (cl-first cur-elt))  result)))))
                                                                        (cdr menu)
                                                                        <span style="color: #b0c4de;">:initial-value</span> ()))))))
                (gen-mnu (plbl lbl menu) (<span style="color: #00ffff;">let*</span> ((num-menu-keys (1- (length menu)))
                                                (num-menu-page (ceiling (/ num-menu-keys 6.0)))
                                                (page-labs     (<span style="color: #00ffff;">cl-loop</span> repeat num-menu-page
                                                                        for i = lbl then min-free-lab
                                                                        collect i
                                                                        when (not (= i lbl))
                                                                        do (<span style="color: #00ffff;">cl-incf</span> min-free-lab)))
                                                (rec-key-labs     nil)
                                                (rec-pag-labs     nil))
                                           (<span style="color: #00ffff;">if</span> (zerop plbl)
                                               (add-m-code (message <span style="color: #fa8072;">"LBL \"%s\""</span> (cl-first menu))))
                                           (<span style="color: #00ffff;">cl-loop</span> for mkey-elt in (cdr menu)
                                                    for mkey-num from 0
                                                    for page-num = (truncate (/ mkey-num 6))
                                                    for page-key = (mod mkey-num 6)
                                                    for mkey-str = (<span style="color: #00ffff;">if</span> (vectorp mkey-elt) (aref mkey-elt 0) (cl-first mkey-elt))
                                                    when (= page-key 0)
                                                    do (<span style="color: #00ffff;">progn</span> (add-m-code (message <span style="color: #fa8072;">"LBL %02d            @@@@ Page %d of menu %s"</span> (nth page-num page-labs) (1+ page-num) (cl-first menu)))
                                                              (add-m-code <span style="color: #fa8072;">"CLMENU"</span>))
                                                    when (not (string-equal mkey-str <span style="color: #fa8072;">""</span>))
                                                    do (<span style="color: #00ffff;">progn</span> (add-m-code (message <span style="color: #fa8072;">"\"%s\""</span> mkey-str))
                                                              (add-m-code (message <span style="color: #fa8072;">"KEY %d %s %02d"</span> (1+ page-key) (<span style="color: #00ffff;">if</span> (vectorp mkey-elt) <span style="color: #fa8072;">"XEQ"</span> <span style="color: #fa8072;">"GTO"</span>) min-free-lab))
                                                              (<span style="color: #00ffff;">if</span> (vectorp mkey-elt)
                                                                  (<span style="color: #00ffff;">progn</span> (add-x-code (message <span style="color: #fa8072;">"LBL %02d               @@@@ Action for menu key %s"</span> min-free-lab mkey-str))
                                                                         (add-x-code (funcall gen-code (aref mkey-elt 1)))
                                                                         (add-x-code <span style="color: #fa8072;">"RTN"</span>)))
                                                              (<span style="color: #00ffff;">push</span> min-free-lab rec-key-labs)
                                                              (<span style="color: #00ffff;">cl-incf</span> min-free-lab)
                                                              (<span style="color: #00ffff;">push</span> (nth page-num page-labs) rec-pag-labs))
                                                    when (<span style="color: #00ffff;">or</span> (= page-key 5) (= mkey-num (1- num-menu-keys)))
                                                    do (<span style="color: #00ffff;">progn</span> (<span style="color: #00ffff;">if</span> (&lt; 1 num-menu-page)
                                                                  (<span style="color: #00ffff;">progn</span> (add-m-code (message <span style="color: #fa8072;">"KEY 7 GTO %02d"</span> (nth (mod (1- page-num) num-menu-page) page-labs)))
                                                                         (add-m-code (message <span style="color: #fa8072;">"KEY 8 GTO %02d"</span> (nth (mod (1+ page-num) num-menu-page) page-labs)))))
                                                              (<span style="color: #00ffff;">if</span> (string-equal exit-function <span style="color: #fa8072;">"up"</span>)
                                                                  (add-m-code (message <span style="color: #fa8072;">"KEY 9 GTO %02d"</span> plbl))
                                                                  (add-m-code (message <span style="color: #fa8072;">"KEY 9 GTO %02d"</span> 0)))
                                                              (add-m-code <span style="color: #fa8072;">"MENU"</span>)
                                                              (add-m-code <span style="color: #fa8072;">"STOP"</span>)
                                                              (<span style="color: #00ffff;">if</span> (string-equal leaf-function <span style="color: #fa8072;">"stay"</span>)
                                                                  (add-m-code (message <span style="color: #fa8072;">"GTO %02d"</span> (nth page-num page-labs)))
                                                                  (add-m-code (message <span style="color: #fa8072;">"GTO %02d"</span> 0)))))
                                           (<span style="color: #00ffff;">cl-loop</span> for mkey-elt in (cdr menu)
                                                    for m-lab in (reverse rec-key-labs)
                                                    for p-lab in (reverse rec-pag-labs)
                                                    when (listp mkey-elt)
                                                    do (gen-mnu p-lab m-lab mkey-elt)))))
      (gen-mnu 0 1 (prc-mnu (append (list top-lab) (<span style="color: #00ffff;">cl-loop</span> for row in tbl
                                                           for n from 0
                                                           for tmp = (split-string (cl-first row) <span style="color: #fa8072;">":"</span>)
                                                           do (<span style="color: #00ffff;">setf</span> (car (last tmp)) (vector (car (last tmp)) row))
                                                           collect tmp))))
      (add-m-code <span style="color: #fa8072;">"LBL 00"</span>)
      (add-m-code <span style="color: #fa8072;">"EXITALL"</span>)
      (add-m-code <span style="color: #fa8072;">"RTN"</span>)
      (<span style="color: #00ffff;">if</span> (&lt; 100 min-free-lab)
          (<span style="color: #ffc0cb; font-weight: bold;">error</span> <span style="color: #fa8072;">"ERROR: Too many local labels: %d"</span> min-free-lab)))
      (princ m-code)
      (princ x-code)
      (princ (message <span style="color: #fa8072;">"@@@@ Free labels start at: %d\n"</span> min-free-lab))))
</pre>
</div>
</div>
</div>
