src/hp42s-meta.org
*** Template for empty menu code

#+NAME: menu
| Menu |
|------|
| a    |
| b    |
| c    |

#+BEGIN_SRC elisp :var tbl=menu :colnames y :results output verbatum :wrap "src hp42s :tangle yes"
(MJR-generate-42-menu-code "PROG_NAME" tbl "stay" "up" (lambda (x) ""))
#+END_SRC

#+RESULTS:
#+begin_src hp42s :tangle yes
LBL "PROG_NAME"
LBL 01            @@@@ Page 1 of menu PROG_NAME
CLMENU
"a"
KEY 1 XEQ 02
"b"
KEY 2 XEQ 03
"c"
KEY 3 XEQ 04
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 00
EXITALL
RTN
LBL 02               @@@@ Action for menu key a

RTN
LBL 03               @@@@ Action for menu key b

RTN
LBL 04               @@@@ Action for menu key c

RTN
@@@@ Free labels start at: 5
#+end_src

* Emacs Helper Stuff

** Emacs function to insert charcters given a list of character codes

#+BEGIN_SRC elisp :results output verbatum
(defun MJR-ins42char (charn)
  "Insert free42 character at point."
  (interactive "sCharacter Number(s): ")
  (if charn
      (cl-loop for c in (split-string charn)
               do (insert (nth (eval (car (read-from-string c))) '("÷" "×" "√"  "∫" "▒" "Σ" "▸" "π" "¿" "≤"     "[LF]" "≥"     "≠"  "↵" "↓" "→"
                                                                   "←" "μ" "£"  "°" "Å" "Ñ" "Ä" "∡" "ᴇ" "Æ"     "…"    "[ESC]" "Ö"  "Ü" "▒" "•"  ;; CHAR 30 & CHAR 4 are the same unicode.  Not sure how to type a char 30 into a string...
                                                                   " " "!" "\"" "#" "$" "%" "&" "'" "(" ")"     "*"    "+"     ","  "-" "." "/"
                                                                   "0" "1" "2"  "3" "4" "5" "6" "7" "8" "9"     ":"    ";"     "<"  "=" ">" "?"
                                                                   "@" "A" "B"  "C" "D" "E" "F" "G" "H" "I"     "J"    "K"     "L"  "M" "N" "O"
                                                                   "P" "Q" "R"  "S" "T" "U" "V" "W" "X" "Y"     "Z"    "["     "\\" "]" "↑" "_"
                                                                   "`" "a" "b"  "c" "d" "e" "f" "g" "h" "i"     "j"    "k"     "l"  "m" "n" "o"
                                                                   "p" "q" "r"  "s" "t" "u" "v" "w" "x" "y"     "z"    "{"     "|"  "}" "~" "├"
                                                                   ":" "ʏ"))))))
#+END_SRC

#+RESULTS:


