docs/hp42s-meta.html



<div id="outline-container-org8b58670" class="outline-2">
<h2 id="org8b58670"><span class="section-number-2">4</span> Emacs Helper Stuff</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org0ac5fbe" class="outline-3">
<h3 id="org0ac5fbe"><span class="section-number-3">4.1</span> Emacs function to insert charcters given a list of character codes</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #00ffff;">defun</span> <span style="color: #00fa9a; font-weight: bold;">MJR-ins42char</span> (charn)
  <span style="color: #f08080;">"Insert free42 character at point."</span>
  (<span style="color: #00ffff;">interactive</span> <span style="color: #fa8072;">"sCharacter Number(s): "</span>)
  (<span style="color: #00ffff;">if</span> charn
      (<span style="color: #00ffff;">cl-loop</span> for c in (split-string charn)
               do (insert (nth (eval (car (read-from-string c))) '(<span style="color: #fa8072;">"&#247;"</span> <span style="color: #fa8072;">"&#215;"</span> <span style="color: #fa8072;">"&#8730;"</span>  <span style="color: #fa8072;">"&#8747;"</span> <span style="color: #fa8072;">"&#9618;"</span> <span style="color: #fa8072;">"&#931;"</span> <span style="color: #fa8072;">"&#9656;"</span> <span style="color: #fa8072;">"&#960;"</span> <span style="color: #fa8072;">"&#191;"</span> <span style="color: #fa8072;">"&#8804;"</span>     <span style="color: #fa8072;">"[LF]"</span> <span style="color: #fa8072;">"&#8805;"</span>     <span style="color: #fa8072;">"&#8800;"</span>  <span style="color: #fa8072;">"&#8629;"</span> <span style="color: #fa8072;">"&#8595;"</span> <span style="color: #fa8072;">"&#8594;"</span> 
                                                                   <span style="color: #fa8072;">"&#8592;"</span> <span style="color: #fa8072;">"&#956;"</span> <span style="color: #fa8072;">"&#163;"</span>  <span style="color: #fa8072;">"&#176;"</span> <span style="color: #fa8072;">"&#197;"</span> <span style="color: #fa8072;">"&#209;"</span> <span style="color: #fa8072;">"&#196;"</span> <span style="color: #fa8072;">"&#8737;"</span> <span style="color: #fa8072;">"&#7431;"</span> <span style="color: #fa8072;">"&#198;"</span>     <span style="color: #fa8072;">"&#8230;"</span>    <span style="color: #fa8072;">"[ESC]"</span> <span style="color: #fa8072;">"&#214;"</span>  <span style="color: #fa8072;">"&#220;"</span> <span style="color: #fa8072;">"&#9618;"</span> <span style="color: #fa8072;">"&#8226;"</span>  <span style="color: #ffa500;">;; </span><span style="color: #ff7f24;">CHAR 30 &amp; CHAR 4 are the same unicode.  Not sure how to type a char 30 into a string...</span>
                                                                   <span style="color: #fa8072;">" "</span> <span style="color: #fa8072;">"!"</span> <span style="color: #fa8072;">"\""</span> <span style="color: #fa8072;">"#"</span> <span style="color: #fa8072;">"$"</span> <span style="color: #fa8072;">"%"</span> <span style="color: #fa8072;">"&amp;"</span> <span style="color: #fa8072;">"'"</span> <span style="color: #fa8072;">"("</span> <span style="color: #fa8072;">")"</span>     <span style="color: #fa8072;">"*"</span>    <span style="color: #fa8072;">"+"</span>     <span style="color: #fa8072;">","</span>  <span style="color: #fa8072;">"-"</span> <span style="color: #fa8072;">"."</span> <span style="color: #fa8072;">"/"</span> 
                                                                   <span style="color: #fa8072;">"0"</span> <span style="color: #fa8072;">"1"</span> <span style="color: #fa8072;">"2"</span>  <span style="color: #fa8072;">"3"</span> <span style="color: #fa8072;">"4"</span> <span style="color: #fa8072;">"5"</span> <span style="color: #fa8072;">"6"</span> <span style="color: #fa8072;">"7"</span> <span style="color: #fa8072;">"8"</span> <span style="color: #fa8072;">"9"</span>     <span style="color: #fa8072;">":"</span>    <span style="color: #fa8072;">";"</span>     <span style="color: #fa8072;">"&lt;"</span>  <span style="color: #fa8072;">"="</span> <span style="color: #fa8072;">"&gt;"</span> <span style="color: #fa8072;">"?"</span>
                                                                   <span style="color: #fa8072;">"@"</span> <span style="color: #fa8072;">"A"</span> <span style="color: #fa8072;">"B"</span>  <span style="color: #fa8072;">"C"</span> <span style="color: #fa8072;">"D"</span> <span style="color: #fa8072;">"E"</span> <span style="color: #fa8072;">"F"</span> <span style="color: #fa8072;">"G"</span> <span style="color: #fa8072;">"H"</span> <span style="color: #fa8072;">"I"</span>     <span style="color: #fa8072;">"J"</span>    <span style="color: #fa8072;">"K"</span>     <span style="color: #fa8072;">"L"</span>  <span style="color: #fa8072;">"M"</span> <span style="color: #fa8072;">"N"</span> <span style="color: #fa8072;">"O"</span>
                                                                   <span style="color: #fa8072;">"P"</span> <span style="color: #fa8072;">"Q"</span> <span style="color: #fa8072;">"R"</span>  <span style="color: #fa8072;">"S"</span> <span style="color: #fa8072;">"T"</span> <span style="color: #fa8072;">"U"</span> <span style="color: #fa8072;">"V"</span> <span style="color: #fa8072;">"W"</span> <span style="color: #fa8072;">"X"</span> <span style="color: #fa8072;">"Y"</span>     <span style="color: #fa8072;">"Z"</span>    <span style="color: #fa8072;">"["</span>     <span style="color: #fa8072;">"\\"</span> <span style="color: #fa8072;">"]"</span> <span style="color: #fa8072;">"&#8593;"</span> <span style="color: #fa8072;">"_"</span>
                                                                   <span style="color: #fa8072;">"`"</span> <span style="color: #fa8072;">"a"</span> <span style="color: #fa8072;">"b"</span>  <span style="color: #fa8072;">"c"</span> <span style="color: #fa8072;">"d"</span> <span style="color: #fa8072;">"e"</span> <span style="color: #fa8072;">"f"</span> <span style="color: #fa8072;">"g"</span> <span style="color: #fa8072;">"h"</span> <span style="color: #fa8072;">"i"</span>     <span style="color: #fa8072;">"j"</span>    <span style="color: #fa8072;">"k"</span>     <span style="color: #fa8072;">"l"</span>  <span style="color: #fa8072;">"m"</span> <span style="color: #fa8072;">"n"</span> <span style="color: #fa8072;">"o"</span>
                                                                   <span style="color: #fa8072;">"p"</span> <span style="color: #fa8072;">"q"</span> <span style="color: #fa8072;">"r"</span>  <span style="color: #fa8072;">"s"</span> <span style="color: #fa8072;">"t"</span> <span style="color: #fa8072;">"u"</span> <span style="color: #fa8072;">"v"</span> <span style="color: #fa8072;">"w"</span> <span style="color: #fa8072;">"x"</span> <span style="color: #fa8072;">"y"</span>     <span style="color: #fa8072;">"z"</span>    <span style="color: #fa8072;">"{"</span>     <span style="color: #fa8072;">"|"</span>  <span style="color: #fa8072;">"}"</span> <span style="color: #fa8072;">"~"</span> <span style="color: #fa8072;">"&#9500;"</span>
                                                                   <span style="color: #fa8072;">":"</span> <span style="color: #fa8072;">"&#655;"</span>))))))
</pre>
</div>
</div>
</div>
