docs/hp42s-meta.html


<div id="outline-container-org7cce9a2" class="outline-3">
<h3 id="org7cce9a2"><span class="section-number-3">4.3</span> yas templates</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-snippet"><span style="color: #ff7f24;"># -*- mode: snippet -*-</span>
<span style="color: #ff7f24;"># name: if-then-end</span>
<span style="color: #ff7f24;"># key: if</span>
<span style="color: #ff7f24;"># --</span>
...?   @@@@ IF-BEGIN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span>1<span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (string-to-number yas-text))<span style="color: #00ffff;">}</span>
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>
LBL <span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span> @@@@ IF-THEN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
...    @@@@ True Code (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
LBL <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span> @@@@ IF-END (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)


<span style="color: #ff7f24;"># -*- mode: snippet -*-</span>
<span style="color: #ff7f24;"># name: if-then-else-end</span>
<span style="color: #ff7f24;"># key: ife</span>
<span style="color: #ff7f24;"># --</span>
...?   @@@@ IF-BEGIN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span>1<span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (string-to-number yas-text))<span style="color: #00ffff;">}</span>
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>
LBL <span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span> @@@@ IF-THEN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
...    @@@@ True Code (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>
LBL <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span> @@@@ IF-ELSE (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
...    @@@@ False Code (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)
LBL <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span> @@@@ IF-END (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 1 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>/<span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span><span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (+ 2 (string-to-number yas-text)))<span style="color: #00ffff;">}</span>)


<span style="color: #ff7f24;"># -*- mode: snippet -*-</span>
<span style="color: #ff7f24;"># name: if-then-end-return</span>
<span style="color: #ff7f24;"># key: ifr</span>
<span style="color: #ff7f24;"># --</span>
...?      @@@@ IF-BEGIN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
GTO <span style="color: #00ffff;">${</span><span style="color: #ffc0cb; font-weight: bold;">1</span><span style="color: #00ffff;">:</span>1<span style="color: #6495ed;">$(</span>format <span style="color: #fa8072;">"%02d"</span> (string-to-number yas-text))<span style="color: #00ffff;">}</span>    @@@@ IF-FALSE-BEGIN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
...         @@@@ False Code (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
RTN       @@@@ IF-FALSE-END (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
LBL <span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>    @@@@ IF-TRUE-BEGIN (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
...         @@@@ True Code (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
RTN       @@@@ IF-TRUE-END (<span style="color: #00ffff;">$</span><span style="color: #fa8072;">1</span>)
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org6d58f1d" class="outline-2">
<h2 id="org6d58f1d"><span class="section-number-2">5</span> Prepare Code For Conversion</h2>
<div class="outline-text-2" id="text-5">
<p>
I include comments like <code>@@##</code> that I use like compiler directives in C.  They provide a way to remove lines of code that are incompatible or unnecessary for
the target version of free42.  It's a bit of a hack, but it lets me maintain one program for diff-rent versions of free42.
</p>
</div>
